In [1]:
b = open('data.csv', 'x')
b.close()

In [6]:
import pandas as pd
df = pd.read_csv('data.csv', index_col='Sn')
df

      Name   Age     Address     phone
Sn
1      Ram    18   satdobato  98989898
2     Hari    19   lagankhel   9898787
3    shyam    20   kathmandu  23232323
4    Nabin    21   lalitpurm  10101010

In [28]:
import pandas as pd
cols = ['Sn', 'Name', 'Age']
df = pd.read_csv('data.csv', index_col = "Sn", usecols = cols )

In [15]:
import pandas as pd 
df = pd.read_csv('data.csv', index_col = "Sn")
df.iloc[2:6,0:3]

       Name  Age     Address
Sn
3     shyam   20   kathmandu
4     Nabin   21   lalitpurm
5    Nabina   22   lagankhel
6      sita   23      chabel

In [19]:
import pandas as pd 
df = pd.read_csv('data.csv', index_col = "Name")
df[df["Age"]>20]

         Sn  Age    Address      phone
Name
 Nabin    4   21  lalitpurm   10101010
 Nabina   5   22  lagankhel  202020220
 sita     6   23     chabel   30303030

In [29]:
import pandas as pd 
df = pd.read_csv('data.csv', index_col = "Sn")
df[(df["Address"]=="kathmandu") | (df['Age']>19)]
df.to_csv('data1.csv')

In [32]:
import csv

fields = [7, 'Hari', 45, "Patan", 98698698]

f = open('books.csv', 'a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [36]:
import csv

fields = [7, "hari", "Patan", 56565656]
with open('data.csv', 'a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [38]:
fields = [[7,"Ram",22,"patn",9848546], ["Shyam", 985267564]]

import csv

with open('data.csv', 'a') as f:
    x = csv.writer(f)
    for i in fields:
        x.writerow(i)

In [39]:
import csv

with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'Sn': '1', 'Name': ' Ram', 'Age': '18', 'Address': 'satdobato', 'phone': '98989898'}
{'Sn': '3', 'Name': ' shyam', 'Age': '20', 'Address': 'kathmandu', 'phone': '23232323'}
{'Sn': '4', 'Name': ' Nabin', 'Age': '21', 'Address': 'kathmandu', 'phone': '10101010'}
{'Sn': '5', 'Name': ' Nabina', 'Age': '22', 'Address': 'lagankhel', 'phone': '202020220'}
{'Sn': '6', 'Name': ' sita', 'Age': '23', 'Address': 'chabel', 'phone': '303030307', None: ['hari', 'Patan', '56565656']}
{'Sn': 'Ram', 'Name': '9848546', 'Age': None, 'Address': None, 'phone': None}
{'Sn': 'Shyam', 'Name': '985267564', 'Age': None, 'Address': None, 'phone': None}
{'Sn': '7', 'Name': 'Ram', 'Age': '22', 'Address': 'patn', 'phone': '9848546'}
{'Sn': 'Shyam', 'Name': '985267564', 'Age': None, 'Address': None, 'phone': None}

In [42]:
import pandas as pd
data = {'Name': ['Ram', 'Shyam', 'Hari', 'Bikash', 'Samrat'],
       'address': ['Kathmandu', 'lalitput', 'palpa', 'bhaktaur', 'patan'],
       'age': [21,22,23,24,25]}
df = pd.DataFrame(data)
df.to_csv('books2.csv')
df.head()

     Name    address  age
0     Ram  Kathmandu   21
1   Shyam   lalitput   22
2    Hari      palpa   23
3  Bikash   bhaktaur   24
4  Samrat      patan   25

In [43]:
import csv

csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name': 'Ayaush', 'Age': 23, 'Address': 'Kathmandu'},
    {'Name': 'Shyam', 'Age' : 33, 'Address': 'Patan'}
]

try:
    with open("data2.csv", "w") as csvfile:
        writer = csv.DictWriter(csvfile, fieldnames = csv_columns)
        writer.writeheader()
        for data in dict:
            writer.writerow(data)
except IOError:
    print("i/O error")